//Colors

import 'package:flutter/material.dart';

const Color mandarin = Color(0xffFF8702);
const Color customBlack = Color(0xff4C4C69);

const Color grey1 = Color(0xff98A1AA);
const Color grey2 = Color(0xffBCBCBF);
const Color grey3 = Color(0xffE8E8E8);

List<String> months = [
  'января',
  'февраля',
  'марта',
  'апреля',
  'мая',
  'июня',
  'июля',
  'августа',
  'сентября',
  'октября',
  'ноября',
  'декабря'
];

List<String> emotions = [
  'Радость',
  'Страх',
  'Бешенство',
  'Грусть',
  'Спокойствие',
  'Сила',
];

List<List<String>> detailedEmotions = [
  [
    //Радость
    'Возбуждение',
    'Восторг',
    'Игривость',
    'Наслаждение',
    'Очарование',
    'Ликование',
    'Смелость',
    'Удовольствие',
    'Чувственность',
    'Энергичность',
    'Экстравагантность',
  ],
  [
    //Страх
    'Тревога',
    'Беспокойство',
    'Испуг',
    'Паника',
    'Неуверенность',
    'Мучение',
    'Ужас',
    'Боязнь',
    'Угнетение',
    'Стеснение',
    'Ожидание'
  ],
  [
    //Бешенство
    'Злость',
    'Ярость',
    'Гнев',
    'Бешенство',
    'Раздражение',
    'Ненависть',
    'Негодование',
    'Возмущение',
    'Агрессия',
    'Неистовство',
    'Озлобленность'
  ],
  [
    //Грусть
    'Печаль',
    'Тоска',
    'Одиночество',
    'Скорбь',
    'Разочарование',
    'Сожаление',
    'Безысходность',
    'Меланхолия',
    'Уныние',
    'Траур',
    'Мрачность'
  ],
  [
    //Спокойствие
    'Умиротворение',
    'Расслабленность',
    'Безмятежность',
    'Безопасность',
    'Гармония',
    'Равновесие',
    'Стабильность',
    'Благодушие',
    'Уверенность',
    'Миролюбие',
    'Идиллия'
  ],
  [
    //Сила
    'Мужество',
    'Самоуверенность',
    'Решимость',
    'Твердость',
    'Целеустремленность',
    'Упорство',
    'Воля',
    'Выносливость',
    'Энергия',
    'Уверенность',
    'Готовность'
  ],
];
